
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПродажаТовара Приход
	Движения.ПродажаТовара.Записывать = Истина;
	Для Каждого ТекСтрокаСписокТоваров Из СписокТоваров Цикл
		Движение = Движения.ПродажаТовара.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаСписокТоваров.Товар;
		Движение.Сотрудник = Сотрудник;
		Движение.Артикул = Артикул;
		Движение.Количество = ТекСтрокаСписокТоваров.Количество;
		Движение.Сумма = ТекСтрокаСписокТоваров.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходТовара") Тогда
		// Заполнение шапки
		Артикул = ДанныеЗаполнения.Артикул;
		Сотрудник = ДанныеЗаполнения.Сотрудник;
		Для Каждого ТекСтрокаСписокТовара Из ДанныеЗаполнения.СписокТовара Цикл
			НоваяСтрока = СписокТоваров.Добавить();
			НоваяСтрока.Количество = ТекСтрокаСписокТовара.Количество;
			НоваяСтрока.Сумма = ТекСтрокаСписокТовара.Сумма;
			НоваяСтрока.Товар = ТекСтрокаСписокТовара.Товар;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
