
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПродажаТовара Расход
	Движения.ПродажаТовара.Записывать = Истина;
	Для Каждого ТекСтрокаСписокТовара Из СписокТовара Цикл
		Движение = Движения.ПродажаТовара.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаСписокТовара.Товар;
		Движение.Сотрудник = Сотрудник;
		Движение.Артикул = Артикул;
		Движение.Количество = ТекСтрокаСписокТовара.Количество;
		Движение.Сумма = ТекСтрокаСписокТовара.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
